c5/src/Documents/VendorReturn/VendorReturn.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>VendorReturn</name>
  <basedOn>Document.VendorInvoice</basedOn>
  <registerRecords>AccumulationRegister.Allocation</registerRecords>
  <registerRecords>AccumulationRegister.VendorInvoiceDebts</registerRecords>
  <registerRecords>AccumulationRegister.InternalOrders</registerRecords>
  <registerRecords>AccumulationRegister.Provision</registerRecords>
  <registerRecords>AccumulationRegister.Items</registerRecords>
  <registerRecords>AccountingRegister.General</registerRecords>
  <registerRecords>AccumulationRegister.PurchaseOrders</registerRecords>
  <registerRecords>AccumulationRegister.Reserves</registerRecords>
  <registerRecords>AccumulationRegister.PurchaseOrderDebts</registerRecords>
  <registerRecords>AccumulationRegister.VendorDebts</registerRecords>
  <registerRecords>AccumulationRegister.Cost</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>CloseAdvances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentOption</name>
    <type>
      <types>CatalogRef.PaymentOptions</types>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Accounts</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Content</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Dim1</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>Dim2</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>Dim3</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>Factor</name>
      <type>
        <types>DefinedType.Factor</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAccount</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
    <attributes>
      <name>VendorInvoice</name>
      <type>
        <types>DocumentRef.VendorInvoice</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>FixedAssets</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.FixedAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAccount</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
    <attributes>
      <name>VendorInvoice</name>
      <type>
        <types>DocumentRef.VendorInvoice</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>IntangibleAssets</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.IntangibleAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAccount</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
    <attributes>
      <name>VendorInvoice</name>
      <type>
        <types>DocumentRef.VendorInvoice</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrder</name>
      <type>
        <types>DocumentRef.InternalOrder</types>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrderRowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>ProducerPrice</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>PurchaseOrder</name>
      <type>
        <types>DocumentRef.PurchaseOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Social</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAccount</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
    <attributes>
      <name>VendorInvoice</name>
      <type>
        <types>DocumentRef.VendorInvoice</types>
      </type>
    </attributes>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/VendorReturn/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var Reposted;
var Realtime;	

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )

	checkWarehouse ( CheckedAttributes );

EndProcedure
		
Procedure checkWarehouse ( CheckedAttributes )
	
	if ( Items.Count () > 0 ) then
		CheckedAttributes.Add ( "Warehouse" );
	endif; 
	
EndProcedure 

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	if ( DataExchange.Load ) then
		return;
	endif;
	if ( DeletionMark ) then
		InvoiceRecords.Delete ( ThisObject );
	endif;
	setProperties ();
	
EndProcedure

Procedure setProperties ()
	
	Reposted = Posted;
	Realtime = Forms.RealtimePosting ( ThisObject );
	
EndProcedure 

Procedure OnWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		SequenceCost.Rollback ( Ref, Company, PointInTime () );
	endif;
	if ( not DeletionMark ) then
		InvoiceRecords.Sync ( ThisObject );
	endif; 
	
EndProcedure

Procedure UndoPosting ( Cancel )
	
	SequenceCost.Rollback ( Ref, Company, PointInTime () );
	BelongingToSequences.Cost.Clear ();
	
EndProcedure

Procedure Posting ( Cancel, PostingMode )
	
	Env = Posting.GetParams ( Ref, RegisterRecords );
	Cancel = not Documents.VendorReturn.Post ( Env );
	
EndProcedure

#endif
